sergev/LiteBSD/sys/mips/pic32/machdep.c
        (*f)(); /* jump back to prom monitor */
    } else {
        void (*f)() = 0;    // TODO: (void (*)())DEC_PROM_AUTOBOOT;

        if (howto & RB_DUMP)
            dumpsys();
        (*f)(); /* jump back to prom monitor and do 'auto' cmd */
    }
    /*NOTREACHED*/
}

int     dumpmag = (int)0x8fca0101;      /* magic number for savecore */
int     dumpsize = 0;           /* also for savecore */
long    dumplo = 0;

dumpconf()
{
    int nblks;

    dumpsize = physmem;
    if (dumpdev != NODEV && bdevsw[major(dumpdev)].d_psize) {
        nblks = (*bdevsw[major(dumpdev)].d_psize)(dumpdev);
        if (dumpsize > btoc(dbtob(nblks - dumplo)))
            dumpsize = btoc(dbtob(nblks - dumplo));
        else if (dumplo == 0)
            dumplo = nblks - btodb(ctob(physmem));
    }
    /*
     * Don't dump on the first CLBYTES (why CLBYTES?)
     * in case the dump device includes a disk label.
     */
    if (dumplo < btodb(CLBYTES))
        dumplo = btodb(CLBYTES);
}

/*
 * Doadump comes here after turning off memory management and
 * getting on the dump stack, either when called above, or by
 * the auto-restart code.
 */
dumpsys()
{
    int error;

    msgbufmapped = 0;
    if (dumpdev == NODEV)
        return;
    /*
     * For dumps during autoconfiguration,
     * if dump device has already configured...
     */
    if (dumpsize == 0)
        dumpconf();
    if (dumplo < 0)
        return;
    printf("\ndumping to dev %x, offset %d\n", dumpdev, dumplo);
    printf("dump ");
    switch (error = (*bdevsw[major(dumpdev)].d_dump)(dumpdev)) {

    case ENXIO:
        printf("device bad\n");
        break;

    case EFAULT:
        printf("device not ready\n");
        break;

    case EINVAL:
        printf("area improper\n");
        break;

    case EIO:
        printf("i/o error\n");
        break;

    default:
        printf("error %d\n", error);
        break;

    case 0:
        printf("succeeded\n");
    }
}

/*
 * Return the best possible estimate of the time in the timeval
 * to which tvp points.  Unfortunately, we can't read the hardware registers.
 * We guarantee that the time will be greater than the value obtained by a
 * previous call.
 */
void
microtime(tvp)
    struct timeval *tvp;
{
    int s = splclock();
    static struct timeval lasttime;

    *tvp = time;
#ifdef notdef
    tvp->tv_usec += clkread();
    while (tvp->tv_usec > 1000000) {
        tvp->tv_sec++;
        tvp->tv_usec -= 1000000;
    }
#endif
    if (tvp->tv_sec == lasttime.tv_sec &&
        tvp->tv_usec <= lasttime.tv_usec &&
        (tvp->tv_usec = lasttime.tv_usec + 1) > 1000000) {
        tvp->tv_sec++;
        tvp->tv_usec -= 1000000;
    }
    lasttime = *tvp;
    splx(s);
}

/*
 * Convert an ASCII string into an integer.
 */
int
atoi(s)
    char *s;
{
    int c;
    unsigned base = 10, d;
    int neg = 0, val = 0;

    if (s == 0 || (c = *s++) == 0)
        goto out;

    /* skip spaces if any */
    while (c == ' ' || c == '\t')
        c = *s++;

    /* parse sign, allow more than one (compat) */
    while (c == '-') {
        neg = !neg;
        c = *s++;
    }

    /* parse base specification, if any */
    if (c == '0') {
        c = *s++;
        switch (c) {
        case 'X':
        case 'x':
            base = 16;
            break;
        case 'B':
        case 'b':
            base = 2;
            break;
        default:
            base = 8;
        }
    }

    /* parse number proper */
    for (;;) {
        if (c >= '0' && c <= '9')
            d = c - '0';
        else if (c >= 'a' && c <= 'z')
            d = c - 'a' + 10;
        else if (c >= 'A' && c <= 'Z')
            d = c - 'A' + 10;
        else
            break;
        val *= base;
        val += d;
        c = *s++;
    }
    if (neg)
        val = -val;
out:
    return val;
}

/*
 * Delay for a given number of microseconds.
 * The processor has a 32-bit hardware Count register,
 * which increments at half CPU rate.
 * We use it to get a precise delay.
 */
void udelay(unsigned usec)
{
    unsigned now = mfc0 (9, 0); // C0_Count
    unsigned final = now + usec * CPU_KHZ / 2000;

    for (;;) {
    now = mfc0 (9, 0); // C0_Count

    /* This comparison is valid only when using a signed type. */
    if ((int) (now - final) >= 0)
        break;
    }
}

/*
 * Write the given pid into the TLB pid reg.
 */
void tlb_set_pid(unsigned pid)
{
    mtc0_EntryHi(pid);                  /* Set up entry high */
    asm volatile ("ehb");               /* Hazard barrier */
}

/*
 * Write the entry into the wired part of TLB at the given index.
 */
void tlb_write_wired(unsigned index, unsigned hi, unsigned lo0, unsigned lo1)
{
    int x = mips_di();                  /* Disable interrupts */
    int pid = mfc0_EntryHi();           /* Save the current PID */

    mtc0_Index(index);                  /* Set the index */
    mtc0_EntryHi(hi);                   /* Set up entry high */
    mtc0_EntryLo0(lo0);                 /* Set up entry low 0 */
    mtc0_EntryLo1(lo1);                 /* Set up entry low 1 */
    asm volatile ("ehb");               /* Hazard barrier */
    asm volatile ("tlbwi");             /* Write the TLB entry */

    mtc0_Wired(index + 1);              /* Set the number of wired entries */

    mtc0_EntryHi(pid);                  /* Restore the PID */
    mtc0_Status(x);                     /* Restore interrupts */
    asm volatile ("ehb");               /* Hazard barrier */
}

/*
 * Flush the "random" entries from the TLB.
 */
void tlb_flush()
{
    int x = mips_di();                  /* Disable interrupts */
    int pid = mfc0_EntryHi();           /* Save the current PID */
    int index;

    mtc0_EntryHi(MACH_CACHED_MEMORY_ADDR);  /* Use invalid memory address */
    mtc0_EntryLo0(0);                   /* Zero out low entry 0 */
    mtc0_EntryLo1(0);                   /* Zero out low entry 1 */
    for (index=VMMACH_FIRST_RAND_ENTRY; index<VMMACH_NUM_TLB_ENTRIES; index++) {
        mtc0_Index(index);              /* Set the index */
        asm volatile ("ehb");           /* Hazard barrier */
        asm volatile ("tlbwi");         /* Write the TLB entry */
    }
    mtc0_EntryHi(pid);                  /* Restore the PID */
    mtc0_Status(x);                     /* Restore interrupts */
    asm volatile ("ehb");               /* Hazard barrier */
}

