sergev/LiteBSD/sys/mips/pic32/machdep.c
/*
 * Flush any TLB entries for the given address and TLB PID.
 */
void tlb_flush_addr(unsigned hi)
{
    int x = mips_di();                  /* Disable interrupts */
    int pid = mfc0_EntryHi();           /* Save the current PID */
    int index;

    mtc0_EntryHi(hi);                   /* Look for addr & PID */
    asm volatile ("ehb");               /* Hazard barrier */
    asm volatile ("tlbp");              /* Probe for the entry */

    index = mfc0_Index();               /* See what we got */
    if (index >= 0) {
        /* Entry found - mark it as invalid. */
        mtc0_EntryHi(MACH_CACHED_MEMORY_ADDR);  /* Use invalid memory address */
        mtc0_EntryLo0(0);               /* Zero out low entry 0 */
        mtc0_EntryLo1(0);               /* Zero out low entry 1 */
        asm volatile ("ehb");           /* Hazard barrier */
        asm volatile ("tlbwi");         /* Write the TLB entry */
    }
    mtc0_EntryHi(pid);                  /* Restore the PID */
    mtc0_Status(x);                     /* Restore interrupts */
    asm volatile ("ehb");               /* Hazard barrier */
}

/*
 * Update the TLB entry if highreg is found; otherwise, enter the data.
 */
void tlb_update (unsigned hi, unsigned lo)
{
    int x = mips_di();                  /* Disable interrupts */
    int pid = mfc0_EntryHi();           /* Save the current PID */
    int index;

    mtc0_EntryHi(hi);                   /* Look for addr & PID */
    asm volatile ("ehb");               /* Hazard barrier */
    asm volatile ("tlbp");              /* Probe for the entry */
    index = mfc0_Index();               /* See what we got */

    if (hi & (1 << PGSHIFT)) {
        /* Odd page. */
        mtc0_EntryLo1(lo);              /* Init low entry 0 */
        if (index >= 0) {
            /* Entry found - update EntryLo1. */
            asm volatile ("ehb");       /* Hazard barrier */
            asm volatile ("tlbwi");     /* Write the TLB entry */
        } else {
            /* Not found - install new entry. */
            mtc0_EntryHi(hi);           /* Restore high reg */
            mtc0_EntryLo0(lo & PG_G);   /* Clear low entry 0 */
            asm volatile ("ehb");       /* Hazard barrier */
            asm volatile ("tlbwr");     /* Enter into a random slot */
        }
    } else {
        /* Even page. */
        mtc0_EntryLo0(lo);              /* Init low entry 0 */
        if (index >= 0) {
            /* Entry found - update EntryLo0. */
            asm volatile ("ehb");       /* Hazard barrier */
            asm volatile ("tlbwi");     /* Write the TLB entry */
        } else {
            /* Not found - install new entry. */
            mtc0_EntryHi(hi);           /* Restore high reg */
            mtc0_EntryLo1(lo & PG_G);   /* Clear low entry 1 */
            asm volatile ("ehb");       /* Hazard barrier */
            asm volatile ("tlbwr");     /* Enter into a random slot */
        }
    }
    mtc0_EntryHi(pid);                  /* Restore the PID */
    mtc0_Status(x);                     /* Restore interrupts */
    asm volatile ("ehb");               /* Hazard barrier */
}
